text_process = {
    '系统错误' : '''系统错误，请联系管理员修复~~''',

    '关注' : '''啦啦啦，啦啦啦，我们是河大的小管家！
“河小博”“河小知”“河掌柜”三个萌娃带你走遍河大！

学习上有问题就找“河小博”
生活有疑惑就找“河小知”
还有什么想问的就找“河掌柜”哈~~

回复【菜单】即可找到三个萌娃噻~~''',


    '留言' : '''您的留言小编已经收到了
回复【菜单】查看全部功能哦''',


    '河小博' : '''好好学习，天天向上
HELLO~我是河小博~
回复括号内的信息进行下一步查询
 【成绩查询】
 【图书信息】
 【空闲自习室】
 【网上评教】
 【办公电话】''',


    '河小知' : '''嗨亲~我是河小知~
活动超丰富，小知都知道哟~
回复括号内的信息进行下一步查询
 【国际交流】
 【社团活动】''',


    '河掌柜' : '''来喽~我是河掌柜~
有事您说话~
回复括号内的信息进行下一步查询
 【天气预报】
 【公交查询】
 【后勤报修】''',


    '菜单' : '''回复以下括号内的关键词就可以收到相应的内容哦
河小博：
 【成绩查询】
 【课表查询】
 【图书信息】
 【空闲自习室】
 【网上评教】
河小知：
 【天气预报】
 【公交查询】
 【快递查询】
 【办公电话】
 【国际交流】
 【创业就业】
河掌柜：
 【学生公寓】
 【后勤报修】
 【河大全景】
 【培训信息】
 【河大驾校】
 【图书订购】
 【易百超市】
 【意见反馈】
新生同学看过来:
 【新生】''',


    '绑定学号' : '''亲，要先绑定学号哦！
绑定学号的操作方法为: 
发送“绑定+空格+学号+空格+教务系统密码” 
如：绑定 20181234123 20181234123 
教务系统的初始密码是学号，学号绑定的密码一定要与教务系统密码一致呦!
如果教务系统密码发生了修改，务必要修改河大青年的密码为教务系统密码!
可发送“修改密码”获取提示，根据提示修改密码。''',


    '绑定格式' : '''绑定学号的操作方法为: 
发送“绑定+空格+学号+空格+教务系统密码”''',


    '绑定成功' : '''绑定成功！
发送【我的学籍】查看已绑信息
发送【修改密码】查看如何修改密码
发送【解除绑定】解除绑定的学号
发送【我的成绩】即可查询本学期成绩''',


    '绑定失败' : '''绑定失败!请仔细检查:
账号为学号，密码为教务系统密码哦~
可能系统网络延迟，也可以重新尝试哦~''',


    '已经绑定' : '''亲，你已经绑定咯~
发送【修改密码】查看如何修改密码''',


    '解除绑定' : '''回复【确认解绑】解除绑定
解除绑定后，不能使用成绩查询等功能哦~~''',


    '解绑成功' : '''解除绑定成功
你仍可以使用部分功能哦~~
回复【菜单】即可查看全部功能哦''',


    '修改密码' : '''亲，修改密码格式如下哦
请回复：改密+空格+教务系统密码
如：改密 20181234123''',

    
    '改密格式' : '''修改密码的操作方法为: 
发送“改密+空格+教务系统密码”''',


    '改密成功' : '''修改成功!
发送【我的学籍】查看已绑信息
发送【修改密码】查看如何修改密码
发送【解除绑定】解除绑定的学号
发送【我的成绩】即可查询本学期成绩''',


    '改密失败' : '''修改失败!请仔细检查:
密码为教务系统密码哦~
可能系统网络延迟，也可以重新尝试哦~''',


    '成绩查询' : '''发送【我的学籍】查看学籍信息
发送【我的成绩】查看本学期成绩
发送【所有成绩】即可查询所有成绩''',


    '天气预报' : '''来喽~我是河掌柜~有事您说话~
请回复：天气+空格+城市
如：天气 保定''',


    '学生公寓' : '''回复：
【调宿服务】
【退宿服务】
【公寓电话】
即可查看详细说明''',


    '图书信息' : '''好好学习，天天向上
HELLO~我是河小博~
请回复：图书+空格+图书名称
如：图书 新闻学概论''',


    '空闲自习室' : '''好好学习，天天向上
HELLO~我是河小博~
<a href='http://twwx.hbu.edu.cn/index.php/fun/classroom'>点击我进入空闲自习室查询</a>''',


    '天气预报' : '''来喽~我是河掌柜~有事您说话~
请回复：天气+空格+城市
如：天气 保定''',


    '公交查询' : '''目前只提供保定市公交线路查询哦~~~
1.发送"公交路线"即可查询保定市的所有公交路线
2.发送"公交+空格+公交线路"如："公交 27"即可查询该线路所有站点
3.发送"公交+空格+起点+空格+终点"即可查询可乘坐的公交线路，如"公交 河北大学 火车站"''',


    '快递查询' : '''快递查询方式为：
发送"快递+空格+快递单号"即可查询快递信息，
如：快递 123456789''',


    '办公电话' : '''好好学习,天天向上
HELLO~我是河小博~
1.请回复："办公机构" 即可查询所有办公机构
2.请回复："电话+空格+办公机构"
如"电话 物理学院"即可查询办公电话''',


    '国际交流' : '''<a href="http://oice.hbu.edu.cn/">河小博带你走进国际交流处，点击即可查看（建议在wifi环境下使用）</a>''',
    

    '创业就业' : '''嗨亲~我是河小知 发送:
【我来创业】
【就业信息】
即可进行查询哦''',


    '我来创业' : '''嗨亲~我是河小知 
发送括号内的关键词
【创业基地简介】
【入驻条件】
【入驻程序】
【创业优惠政策】
即可进行创业信息查询哦''',


    '创业基地简介' : '''大学生创业孵化基地简介
大学生创业孵化基地(以下简称创业基地)是在高新区管委会和河北大学的领导下，由河大科技园有限公司负责指导与管理。大学生创业孵化基地是河大科技园有限公司下属综合性指导机构，基地实行企业化管理，为入驻大学生创业、就业提供物质帮助与技术支持。
创业基地的主要任务：提供创业孵化场地和孵化企业基本办公条件，搭建科技信息网络平台，提供科技和产业信息，帮助创业孵化企业进入市场或营造局部市场环境以及为入孵企业提供法律、财务、管理等创业所需的重要信息及咨询服务。
地址：河北省保定市北二环路5699号大学科技园7号楼A座 
电话：0312-3376005   0312-5077331 
Email: hbdxkjy@126.com
传真：0312-3376006 
邮编：071051''',


    '入驻条件' : '''创业基地入驻条件
1、符合国家产业、技术政策，技术含量较高，创新性较强，有较强的市场竞争力，有利于节能降耗和环境保护，经济效益和社会效益显著，孵化项目原则上应立足于创业团队的自身专业领域，以提高专业技能和创新实践能力为主要目的；
2、孵化企业具有完整创业计划，启动资金和创业团队，具有明确的市场应有的目标和市场经营计划，并通过创业基地审核的，准备开业的企业；
3、处于研发阶段的项目（需有明确的市场应用目标和经营构想），可以项目组的形式入驻创业基地；
4、必须是在保定国家高新区工商行政管理部门注册登记的法人实体，或已注册登记的，必须将公司注册地迁到保定国家高新区
5、公司负责人（或孵化企业法人）为全日制在校大学生，或毕业两年内的大学生，具有较高的素养和品格，懂政策，重信誉，有一定的经营能力，接受河大科技园有限公司的管理，遵守一切规章制度。''',


    '入驻程序' : '''创业基地入驻程序
1、提交申请入驻材料。
入驻企业提供的材料有：入驻基地申请；商业计划书；公司相关管理制度、企业章程；法定代表人简历及身份证明复印件；营业执照证书复印件；企业委托代办相关手续的，需提供注册登记所需的有关证明材料。
2、企业填写企业基本情况表。
3、基地进行初步审查，报河大科技园有限公司创业导师团审批。
4、评审通过后，签定入驻创业基地协议。
5、基地协助孵化企业搬迁入驻，办理相关证、照。
具体程序请与我处联系
地址：河北省保定市国家高新技术开发区朝阳路科技园 
电话：0312-5077329 
Email: kjy@hbu.edu.cn
传真：5077331 
邮编：071002''',


    '创业优惠政策' : '''入驻企业性质与优惠政策
大学生创业公司分为设计类、服务类和商贸类等类型的公司。基地鼓励工业设计、软件设计类企业优先入驻，智力服务类、商贸类公司其次，对于其他类型公司进行严格审批。
创业公司营运资金实行“学生自筹+创业基金资助”的模式；
学校为入驻公司提供以下支持与优惠：
1、免费为入驻企业提供1年场地租赁费；一年免租期到期后，在孵企业可继续留在孵化基地，第二年享受市场租赁费减半的优惠，第三年以市场价缴纳租赁费，孵化满三年后，在孵企业必须退出创业基地，并优先推荐其进入科技园园或产业园进一步孵化；
2、免费为入驻公司提供网络端口、电源接口、办公桌椅、资料柜等办公设备（孵化器项目经费中出）
3、对公司办理工商、税务登记和变更、年检及公司代码、银行开户手续提供指导；
4、为入驻企业提供有偿财务会计服务（专设一人）
5、联系有协作关系的咨询公司，为公司提供技术与管理的咨询服务；
6、提供文讯、打字复印等有偿服务；
7、帮助企业解决其他有关事宜。''',


    '就业信息' : '''嗨亲~我是河小知~近期招聘信息汇总如下哦:
<a href='http://job.hbu.cn：8080/news/ShowArticle.asp?ArticleID=2337'>麦当劳校园招聘</a>
<a href='http://job.hbu.cn：8080/news/ShowArticle.asp?ArticleID=2340'>5月19日河北大学小型招聘会参会企业名单</a>
<a href='http://job.hbu.cn：8080/news/ShowArticle.asp?ArticleID=2295'>北京爱其科技有限公司校园招聘</a>
<a href='http://job.hbu.cn：8080/news/ShowArticle.asp?ArticleID=2293'>5月12日河北大学小型招聘会参会企业名单</a>
<a href='http://job.hbu.cn：8080/news/ShowArticle.asp?ArticleID=2290'>永旺集团招聘</a>

具体信息以校就业指导网公布信息为准''',


    '学生公寓' : '''回复：
【调宿服务】
【退宿服务】
【公寓电话】
即可查看详细说明''',


    '调宿服务' : '''【1】因特殊原因学生个人申请调宿的，凭个人书面申请，经学生所在学院同意、园区办公室审核，到公寓中心综合部办理调宿手续。
【2】学生公寓办理学生调宿手续：楼层服务员检查原宿舍公共设施情况，收回宿舍钥匙，退还学生住宿卡片；学生凭住宿卡片到调整后公寓值班室，工作人员核对、更改住宿卡片，发放宿舍钥匙，学生将个人物品搬入调整后宿舍。''',


    '退宿服务' : '''【1】退宿条件：A身体有疾病，确需在外休养，B家在保定市居住，C在校勤工俭学需夜间值班。
【2】学生凭离校通知单或《河北大学学生公寓退宿申请表》到公寓办理退宿手续。
【3】楼层服务员检验宿舍公共设施。
【4】学生交回宿舍钥匙，公寓楼长在离校通知单或退宿审批表加盖公寓检验章。
【5】中心在离校通知单或退宿审批表加盖公寓中心章，涉及退住宿费的到公司财务部办理退费手续。
【6】学生搬出宿舍，退宿办理完毕。''',


    '公寓电话' : '''【校本部公寓】
茗园公寓 5079449
慧园公寓 5079323
沁园公寓 5079451
菊园公寓 5079452
桂园公寓 5079453
芳园公寓 5079454
荷园公寓 5079665
熙园公寓 5079667
竹园公寓 5079689
馨园公寓 5079670
梅园公寓 5079311
恬园公寓 5079639
【新校区公寓】
厚望公寓 南5929923/北7532021
厚泽公寓 南5929925/北5929924
厚朴公寓 南5929927/北7532026
信佳公寓 5929996
信香公寓 南5929928/北5929929
信然公寓 南5929932/中5929933/北5929934
信士公寓 南5929930 /北5929931
馨宁公寓 南5929946/ 北5929948
馨雅公寓 南5929944/北5929945
馨清公寓 5929950
馨逸公寓 5929952
馨源公寓 南5929916/北5929918
【医学部公寓】
学生公寓1号楼：5075681
学生公寓2号楼：5075682
学生公寓3号楼：5075683
学生公寓4号楼：7910658
学生公寓5号楼：7910659''',


    '后勤报修' : '''【本部、新校区】
综合保障服务热线“7532000”、“7532555”24小时为您提供维修、咨询和服务投诉等服务。

【医学部】
后勤服务公司24小时维修电话。
水暖维修：5097495；
电力维修：5097498；
负责人电话：13833033717''',


    '河大全景' : '''<a href="https://jiejing.qq.com/#pano=11061118130817105158100&heading=5&pitch=1&zoom=1&isappinstalled=-1&poi=0">河小知带你走遍河大，点击即可查看（建议在wifi环境下使用）</a>''',


    '培训信息' : '''后勤集团培训学校送福利啦！有意参加教师资格证、会计证、人力资源师、秘书、心理咨询师、育婴师、公共营养师等培训项目的同学注意喽！
【一】凡关注“河北大学青年”微信公众服务平台的河北大学在册学生到我校报名培训项目学费优惠5%。
【二】 凡报名参加我校培训项目的学员均可成为我校会员。会员享受以下增值服务：
 【1】所有会员免费在我校教室上自习。
 【2】自带笔记本电脑的会员享受免费无线上网服务。
 【3】全天免费供应饮用水。
 【4】不定期向会员免费提供励志电影服务。
【本部校区地址】河大本部南院浴池三楼           
咨询电话：0312-5958960
【新区校区地址】河大新区坤舆园区餐厅北侧四楼
咨询电话：0312-5929995''',


    '河大驾校' : '''河北大学驾驶员培训学校于2002年成立，驾校占地面积60亩，拥有教练车40辆，C1/C2两个培训车型，配有45台电脑智能化答题教室，电动式教车一台，电子操纵仿真模拟器4部，机械模拟器15台，解剖车一部，并配有专门的模拟教学室，具有二级资质的大型国营驾校。

十余年来，驾校多次获得了省市交通运管部门颁发的“省级先进驾校”、“AAA驾校”等多项荣誉。

咨询服务热线：0312-7532111（新区）0312-5079017（本部）''',


    '图书订购' : '''亲爱的同学们，河北大学青年联合后勤集团推出当当网图书代购活动了！同学们绑定学号后，将获得当当网图书零利润、免运费代购服务哦！喜欢读书的同学过来看一看啦！同学们再也不用担心自己没有时间去去“当当”了。
【服务项目】如下：
 【1】后勤集团代购服务集中采购，为同学们节约运费；
 【2】后勤集中收货，同学们可选择自主时间取货；
 【3】同学们可选择货到付款，后勤集团可以为同学们提前支付，降低购买风险；
 【4】如果同学们在当当网上没有找到需要的书，后勤集团可以为大家联系出版社直接订购。
【订购方法】：
 【1】同学们先到当当网上选择需要购买的图书；
 【2】之后将图书信息交至本部南院八教学楼一层西侧赫达文化传播公司业务办公室，留下联系方式并交纳小额订金，业务办公室联系电话：13603240321
 【3】收货后以短信或电话的方式通知同学们取货；
 【4】同学们选择空闲时间取货并支付书款。''',


    '易百超市' : '''易百超市共有五个超市，其中：
【毓秀园店】
河大本部南院，服务电话：5079563；
【怡然亭店】
河大北院，服务电话：5971145； 
【坤舆湖店】
河大新区坤舆湖的南面，服务电话：7532004；
【坤舆泉店】
坤舆园区综合楼的北侧，服务电话：7532007；
【易百新店】
馨源楼的西面，服务电话：5922099；

各点服务时间为：早7:30分—晚10:30分，''',


    '新生' : '''<a href="http://h.eqxiu.com/s/bCG5asAT">hello！欢迎新童鞋！点击即可查询新生板块。河大青年在手中，学习生活很轻松！（建议在wifi环境下打开）</a>
'''
}


image_process = [
    {
        'keyword' : '',
        'media_id' : ''
    },
    {
        'keyword' : '',
        'media_id' : ''
    },
    {
        'keyword' : '',
        'media_id' : ''
    }
]

voice_process = [
    {
        'keyword' : '',
        'media_id' : ''
    },
    {
        'keyword' : '',
        'media_id' : ''
    },
    {
        'keyword' : '',
        'media_id' : ''
    }
]

video_process = [
    {
        'keyword' : '',
        'media_id' : '',
        'title' : '',
        'description': ''
    },
    {
        'keyword' : '',
        'media_id' : '',
        'title' : '',
        'description': ''
    },
    {
        'keyword' : '',
        'media_id' : '',
        'title' : '',
        'description': ''
    }
]

music_process = [
    {
        'keyword' : '',
        'thumb_media_id' : '',
        'title' : '',
        'description': '',
        'music_url' : '',
        'hq_music_url' : ''
    },
    {
        'keyword' : '',
        'thumb_media_id' : '',
        'title' : '',
        'description': '',
        'music_url' : '',
        'hq_music_url' : ''
    },
    {
        'keyword' : '',
        'thumb_media_id' : '',
        'title' : '',
        'description': '',
        'music_url' : '',
        'hq_music_url' : ''
    }
]

news_process = [
    {
        'keyword' : '',
        'title' : '',
        'description': '',
        'pic_url' : '',
        'url' : ''
    },
    {
        'keyword' : '',
        'title' : '',
        'description': '',
        'pic_url' : '',
        'url' : ''
    },
    {
        'keyword' : '',
        'title' : '',
        'description': '',
        'pic_url' : '',
        'url' : ''
    }
]
