text_process = {
    '系统错误' : '''系统错误，请联系管理员修复~~''',


    '绑定学号' : '''亲，要先绑定学号哦！
绑定学号的操作方法为: 
发送“绑定+空格+学号+空格+教务系统密码” 
如：绑定 20181234123 20181234123 
教务系统的初始密码是学号，学号绑定的密码一定要与教务系统密码一致呦!
如果教务系统密码发生了修改，务必要修改河大青年的密码为教务系统密码!
可发送“修改密码”获取提示，根据提示修改密码。''',


    '绑定格式' : '''绑定学号的操作方法为: 
发送“绑定+空格+学号+空格+教务系统密码”''',


    '绑定成功' : '''绑定成功！
发送【我的学籍】查看已绑信息
发送【修改密码】查看如何修改密码
发送【解除绑定】解除绑定的学号
发送【我的成绩】即可查询本学期成绩''',


    '绑定失败' : '''绑定失败!请仔细检查:
账号为学号，密码为教务系统密码哦~
可能系统网络延迟，也可以重新尝试哦~''',


    '已经绑定' : '''亲，你已经绑定咯~
发送【修改密码】查看如何修改密码''',


    '解除绑定' : '''回复【确认解绑】解除绑定
解除绑定后，不能使用成绩查询等功能哦~~''',


    '解绑成功' : '''解除绑定成功
你仍可以使用部分功能哦~~
回复【菜单】即可查看全部功能哦''',


    '修改密码' : '''亲，修改密码格式如下哦
请回复：改密+空格+教务系统密码
如：改密 20181234123''',

    
    '改密格式' : '''修改密码的操作方法为: 
发送“改密+空格+教务系统密码”''',


    '改密成功' : '''修改成功!
发送【我的学籍】查看已绑信息
发送【修改密码】查看如何修改密码
发送【解除绑定】解除绑定的学号
发送【我的成绩】即可查询本学期成绩''',


    '改密失败' : '''修改失败!请仔细检查:
密码为教务系统密码哦~
可能系统网络延迟，也可以重新尝试哦~''',


    '关注' : '''啦啦啦，啦啦啦，我们是河大的小管家！
“河小博”“河小知”“河掌柜”三个萌娃带你走遍河大！

学习上有问题就找“河小博”
生活有疑惑就找“河小知”
还有什么想问的就找“河掌柜”哈~~

回复【菜单】即可找到三个萌娃噻~~''',


    '留言' : '''您的留言小编已经收到了
回复【菜单】查看全部功能哦''',


    '河小博' : '''好好学习，天天向上
HELLO~我是河小博~
回复括号内的信息进行下一步查询
 【成绩查询】
 【图书信息查询】
 【空闲自习室查询】
 【考试安排】
 【网上评教】
 【办公电话''',


    '河小知' : '''嗨亲~我是河小知~
活动超丰富，小知都知道哟~
回复括号内的信息进行下一步查询
 【学术报告】
 【国际交流】
 【招聘信息】
 【社团活动】
 【走遍河大''',


    '河掌柜' : '''来喽~我是河掌柜~
有事您说话~
回复括号内的信息进行下一步查询
 【食堂资讯】
 【天气预报】
 【公交信息】
 【列车时刻】
 【后勤报修】
 【河大周边''',


    '菜单' : '''回复以下括号内的关键词就可以收到相应的内容哦
河小博：
 【成绩查询】
 【课表查询】
 【图书信息】
 【空闲自习室】
 【考试安排】
 【网上评教】
河小知：
 【天气预报】
 【公交信息】
 【快递查询】
 【办公电话】
 【国际交流】
 【创业就业】
 【公益河大】
 【大型活动】
河掌柜：
 【学生公寓】
 【国交中心服务】
 【后勤报修】
 【特色菜品】
 【爱心特价菜】
 【订餐派送】
 【个性化订餐】
 【河大全景】
 【洗衣服务】
 【培训信息】
 【河大驾校】
 【图书订购】
 【易百超市】
 【意见反馈】
新生同学看过来:
 【新生】''',


    '成绩查询' : '''发送【我的学籍】查看学籍信息
发送【我的成绩】查看本学期成绩
发送【所有成绩】即可查询所有成绩''',


    '天气预报' : '''来喽~我是河掌柜~有事您说话~
请回复：天气+空格+城市
如：天气 保定''',


    '学生公寓' : '''回复：
【调宿服务】
【退宿服务】
【公寓电话】
即可查看详细说明'''
}


image_process = [
    {
        'keyword' : '',
        'media_id' : ''
    },
    {
        'keyword' : '',
        'media_id' : ''
    },
    {
        'keyword' : '',
        'media_id' : ''
    }
]

voice_process = [
    {
        'keyword' : '',
        'media_id' : ''
    },
    {
        'keyword' : '',
        'media_id' : ''
    },
    {
        'keyword' : '',
        'media_id' : ''
    }
]

video_process = [
    {
        'keyword' : '',
        'media_id' : '',
        'title' : '',
        'description': ''
    },
    {
        'keyword' : '',
        'media_id' : '',
        'title' : '',
        'description': ''
    },
    {
        'keyword' : '',
        'media_id' : '',
        'title' : '',
        'description': ''
    }
]

music_process = [
    {
        'keyword' : '',
        'thumb_media_id' : '',
        'title' : '',
        'description': '',
        'music_url' : '',
        'hq_music_url' : ''
    },
    {
        'keyword' : '',
        'thumb_media_id' : '',
        'title' : '',
        'description': '',
        'music_url' : '',
        'hq_music_url' : ''
    },
    {
        'keyword' : '',
        'thumb_media_id' : '',
        'title' : '',
        'description': '',
        'music_url' : '',
        'hq_music_url' : ''
    }
]

news_process = [
    {
        'keyword' : '',
        'title' : '',
        'description': '',
        'pic_url' : '',
        'url' : ''
    },
    {
        'keyword' : '',
        'title' : '',
        'description': '',
        'pic_url' : '',
        'url' : ''
    },
    {
        'keyword' : '',
        'title' : '',
        'description': '',
        'pic_url' : '',
        'url' : ''
    }
]
